bobcmartin/AVRCore/boards.txt
menu.chip=Chip
menu.wiremode=I2C Modes


##### BOARD NAMES #####

avrda.name=AVR128DA48 Curiosity Nano
avrdb.name=AVR128DB48 Curiosity Nano




#############################
# Default settings AVR-DA48 #
#############################

# Bootloading parameters and fuses
avrda.upload.tool=avrdude
avrda.upload.prog_interlock=
avrda.build.board=avrda
avrda.build.core=avrcore
avrda.build.text_section_start=.text=0x0
avrda.build.export_merged_output=false
avrda.build.mcupostfix=
avrda.build.printf=
avrda.build.printfabr=
avrda.build.attachabr=
avrda.build.wireabr=
avrda.build.appspmabr=.spm{bootloader.CODESIZE}

# Bootloading parameters and fuses 
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase
avrda.bootloader.appspm=
avrda.bootloader.BOOTSIZE=0x00

# Chip (memory and pincount) 
avrda.menu.chip.128DA48=AVR128DA48
avrda.menu.chip.128DA48.build.mcu=avr128da48
avrda.menu.chip.128DA48.upload.maximum_size=131072
avrda.menu.chip.128DA48.upload.maximum_data_size=16384
avrda.menu.chip.128DA48.build.variant=48pin-standard

# Clock Speed + Source options
avrda.build.f_cpu=24000000L
avrda.build.speed=24

avrdb.build.flmapabr=.fld


# BrownOut Detection (BOD) Options
avrda.bootloader.bodlevbits=000

# Retain EEPROM (EESAVE) 
avrda.bootloader.eesavebit=1

# Reset pin as GPIO option 
avrda.bootloader.resetpinbits=10

# Startup time options 
avrda.bootloader.SYSCFG1=0x04

avrda.menu.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
avrda.build.flmapabr=.fld
avrda.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3

################################
#  AVR-DB Settings             #
################################


# Parameters and defaults for DB parts 
avrdb.upload.tool=avrdude
avrdb.upload.prog_interlock=
avrdb.build.board=avrdb
avrdb.build.core=avrcore
avrdb.build.f_cpu={build.speed}000000L
avrdb.build.text_section_start=.text=0x0
#avrdb.build.extra_flags= {bootloader.appspm}
avrdb.build.export_merged_output=false
avrdb.build.mcupostfix=
avrdb.build.printf=
avrdb.build.wireabr=

# Bootloading parameters and fuses       
avrdb.bootloader.tool=avrdude
avrdb.bootloader.WDTCFG=0x00
avrdb.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
#avrdb.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrdb.bootloader.CODESIZE=0x00
avrdb.bootloader.BOOTSIZE=0x01
avrdb.bootloader.avrdudestring=
avrdb.bootloader.pymcuprogstring=-aerase

##########################################
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
##########################################

avrdb.build.mcupostfix=
avrdb.build.printfabr=
avrdb.build.attachabr=
avrdb.build.wireabr=
avrdb.build.appspmabr=.spm{bootloader.CODESIZE}


# AVR-DB submenu options                     

# Chip (memory and pincount)             
avrdb.menu.chip.avr128db48=AVR128DB48
avrdb.menu.chip.avr128db48.build.mcu=avr128db48
avrdb.menu.chip.avr128db48.upload.maximum_size=131072
avrdb.menu.chip.avr128db48.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db48.build.variant=48pin-standard


# Clock Speed + Source options
avrdb.build.f_cpu=24000000L
avrdb.build.speed=24
avrdb.build.clocksource=0

# BrownOut Detection (BOD) Options
avrdb.bootloader.bodlevbits=000


# Retain EEPROM (EESAVE)                 
avrdb.bootloader.eesavebit=1

# Reset pin as GPIO option             
avrdb.bootloader.resetpinbits=10

# attachInterrupt Mode                   
avrdb.build.attachmode=-DCORE_ATTACH_ALL

avrdb.build.millistimer=B2

# MVIO menu                              
avrdb.bootloader.mviobits=01


# Startup time options  
# Default set to 8 ms                 
avrdb.bootloader.sutbits=100

avrdb.build.flmapabr=.fld
avrdb.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3

# SPM            
avrdb.bootloader.appspm=
avrdb.bootloader.BOOTSIZE=0x00

############################
# Extra options menu setup #
############################


##### single I2C #####
avrda.menu.wiremode.single=Single
avrda.menu.wiremode.single.build.wiremode=MORS_SINGLE
avrda.menu.wiremode.single.build.wireabr=.wO

##### dual I2C  #####
avrda.menu.wiremode.=2 Wire, Printf float none
avrda.menu.extras.extra2.build.wiremode=MORS_BOTH
avrda.menu.extras.extra2.build.wireabr=.wO2

##### 1x Wire, Minimal Float #####
avrda.menu.extras.extra3=1 Wire, Printf float min
avrda.menu.extras.extra3.build.wiremode=MORS_SINGLE
avrda.menu.extras.extra3.build.wireabr=.wO
avrda.menu.extras.extra3.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.extras.extra3.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrda.menu.extras.extra4=2 Wire, Printf float min
avrda.menu.extras.extra4.build.wire.mode=MORS_BOTH
avrda.menu.extras.extra4.build.wireabr=.wO2
avrda.menu.extras.extra4.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.extras.extra4.build.printfabr=.pfM


##### 1x Wire, Full Float #####
avrda.menu.extras.extra5=1 Wire, Printf float full
avrda.menu.extras.extra5.build.wire.mode=MORS_SINGLE
avrda.menu.extras.extra5.build.wireabr=.wO
avrda.menu.extras.extra5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.extras.extra5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrda.menu.extras.extra6=2 Wire, Printf float full
avrda.menu.extras.extra6.build.wire.mode=MORS_BOTH
avrda.menu.extras.extra6.build.wireabr=.wO2
avrda.menu.extras.extra6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.extras.extra6.build.printfabr=.pfF

##### DB48 extra options menu setup #####

##### 1x Wire, No Float #####
avrdb.menu.extras.extra1=1 Wire, Printf float none
avrdb.menu.extras.extra1.build.wire.mode=MORS_SINGLE
avrdb.menu.extras.extra1.build.wireabr=.wO

##### 2x Wire, No Float #####
avrdb.menu.extras.extra2=2 Wire, Printf float none
avrdb.menu.extras.extra2.build.wire.mode=MORS_BOTH
avrdb.menu.extras.extra2.build.wireabr=.wO2

##### 1x Wire, Minimal Float #####
avrdb.menu.extras.extra3=1 Wire, Printf float min
avrdb.menu.extras.extra3.build.wire.mode=MORS_SINGLE
avrdb.menu.extras.extra3.build.wireabr=.wO
avrdb.menu.extras.extra3.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb.menu.extras.extra3.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrdb.menu.extras.extra4=2 Wire, Printf float min
avrdb.menu.extras.extra4.build.wire.mode=MORS_BOTH
avrdb.menu.extras.extra4.build.wireabr=.wO2
avrdb.menu.extras.extra4.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb.menu.extras.extra4.build.printfabr=.pfM

##### 1x Wire, Full Float #####
avrdb.menu.extras.extra5=1x Wire, Printf float full
avrdb.menu.extras.extra5.build.wire.mode=MORS_SINGLE
avrdb.menu.extras.extra5.build.wireabr=.wO
avrdb.menu.extras.extra5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb.menu.extras.extra5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrdb.menu.extras.extra6=2x Wire, Printf float full 
avrdb.menu.extras.extra6.build.wire.mode=MORS_BOTH
avrdb.menu.extras.extra6.build.wireabr=.wO2
avrdb.menu.extras.extra6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb.menu.extras.extra6.build.printfabr=.pfF


